# Tutorial 3.2

@Date: 19th Nov 2019

[RawData Address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user)

---

**Import libraries**

In [3]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [4]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

users = pd.read_table(url,
                      sep='|',
                      index_col='user_id')

users.head(3)
users.tail(3)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

         age gender occupation zip_code
user_id
941       20      M    student    97229
942       48      F  librarian    78209
943       22      M    student    77841

## groupby

count, mean, std, min, 25%, 50%, 75%, max

In [69]:
users.groupby('occupation').describe().head(3)

                age                                                      \
              count       mean        std   min   25%   50%   75%   max
occupation
administrator  79.0  38.746835  11.123397  21.0  30.0  37.0  48.0  70.0
artist         28.0  31.392857   8.668116  19.0  25.0  30.0  39.0  48.0
doctor          7.0  43.571429  12.501428  28.0  35.5  45.0  48.5  64.0

              gender_n
                 count      mean       std  min  25%  50%  75%  max
occupation
administrator     79.0  0.544304  0.501216  0.0  0.0  1.0  1.0  1.0
artist            28.0  0.535714  0.507875  0.0  0.0  1.0  1.0  1.0
doctor             7.0  1.000000  0.000000  1.0  1.0  1.0  1.0  1.0

### Discover what is the mean age per occupation

In [6]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Discove the Male ratio per occupation and sort it from the most to the least

In [12]:
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

users.head(3)
# apply
# apply the function to the gender column and create a new column
users['gender_n'] = users['gender'].apply(gender_to_numeric)

users.head(3)

a = users.groupby('occupation').gender_n.sum() / users.occupation.value_counts() * 100

# sort 
a.sort_values(ascending = False)

         age gender  occupation zip_code  gender_n
user_id
1         24      M  technician    85711         1
2         53      F       other    94043         0
3         23      M      writer    32067         1

         age gender  occupation zip_code  gender_n
user_id
1         24      M  technician    85711         1
2         53      F       other    94043         0
3         23      M      writer    32067         1

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### For each occupation, calculate the minimum and maximum ages

In [14]:
users.groupby('occupation').age.agg(['min', 'max']).head(3)

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64

### For each combination of occupation and gender, calculate the mean age

In [19]:
users.groupby(['occupation', 'gender']).age.agg(['mean']).head(4)

                           mean
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333

### For each occupation present the percentage of women and men

In [66]:
# create a DataFrame and apply count to gender
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})
print('**gender_ocup:')
gender_ocup.head(4)

# create a DataFrame and apply count for each occupation
occup_count = users.groupby(['occupation']).agg('count')
print('----------\n\n**occup_count:')
occup_count.head(3)

# divide the gender_ocup per the occup_count and multiply per 100
occup_gender = gender_ocup.div(occup_count, level='occupation') * 100
print('----------\n\n**occup_gender:')
occup_gender.head(4)

# present all rows from the gender column
print('---------------\n')
occup_gender.columns
occup_gender[['gender']].head(4)

**gender_ocup:

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15

----------

**occup_count:

               age  gender  zip_code  gender_n
occupation
administrator   79      79        79        79
artist          28      28        28        28
doctor           7       7         7         7

----------

**occup_gender:

                      age     gender  gender_n  zip_code
occupation    gender
administrator F       NaN  45.569620       NaN       NaN
              M       NaN  54.430380       NaN       NaN
artist        F       NaN  46.428571       NaN       NaN
              M       NaN  53.571429       NaN       NaN

---------------

Index(['age', 'gender', 'gender_n', 'zip_code'], dtype='object')

                         gender
occupation    gender
administrator F       45.569620
              M       54.430380
artist        F       46.428571
              M       53.571429